# ShapeImporter Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ShapeImporter Properties
ShapeImporter Class See Also
---
The ShapeImporter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DefaultLengthUnit | The length unit to be used if not specified when the input is a unitless SAT file. |
| InputFormat | The format of the incoming data. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace